t = [233, 303, 81, 129, 200, 82, 115, 228, 64, 17,
     67, 648, 29, 39, 210, 10, 94, 465, 135, 312,
     606, 698, 15, 764, 32, 45, 54, 13, 116, 24,
     477, 16, 841, 95, 3, 79, 118, 208, 9, 59, 171,
     295, 78, 67, 38, 57, 91, 18, 39, 324, 416,
     270, 114, 25, 675, 287, 374, 119, 227, 5,
     109, 94, 171, 226, 183, 350, 27, 64, 433, 88,
     167, 152, 159, 319, 8, 162, 36, 488, 65, 77,
     307, 522, 140, 65, 355, 482, 180, 29, 342,
     233, 117, 182, 184, 113, 86, 630, 476, 136,
     397, 66]
gamma = 0.62
probability_time = 275
lambda_time = 648
t.sort()
N = len(t)
k = 10
h = (t[-1] - 0) / k

# Середній наробіток до відмови Tср
avg = sum(t) / len(t)
print(f"Середній наробіток до відмови Tср = {avg}")

intervals = [0 + i * h for i in range(k + 1)]
temp = []
temp_1 = []
count = [0 for i in range(k + 1)]
for i in range(len(t)):
    for j in range(len(intervals)):
        if intervals[j - 1] < t[i] <= intervals[j]:
            count[j] += 1
fi = [i / (N * h) for i in count[1:]]
pi = [0 for i in range(k)]
for i in range(len(fi)):
    pi[i] = h * sum(fi[(i + 1):])

# γ-відсотковий наробіток на відмову Tγ при γ = 0.62
d_038 = (pi[1] - gamma) / (pi[1] - pi[0])
T_062 = h - h * d_038
print(f"γ-відсотковий наробіток на відмову Tγ при γ = 0.62: {T_062}")

# Ймовірність безвідмовної роботи на час 275 годин
P_275 = 1 - (fi[0] * h + fi[1] * h + fi[2] * h + fi[3] * (probability_time - intervals[3]))
print(f"Ймовірність безвідмовної роботи на час 275 годин: {P_275}")

# Інтенсивність відмов на час 648 годин
P_648 = 1 - (fi[0] * h + fi[1] * h + fi[2] * h + fi[3] * h + fi[4] * h + fi[5] * h + fi[6] * h + fi[7] * (
        lambda_time - intervals[7]))
lambda_648 = fi[7] / P_648
print(f"Інтенсивність відмов на час 648 годин: {lambda_648}")
